In [1]:
import numpy as np
import pandas as pd

In [6]:
df = pd.DataFrame(np.random.rand(335,5))

In [7]:
df

            0         1         2         3         4
0    0.470772  0.249239  0.210232  0.705268  0.585135
1    0.533156  0.933199  0.552222  0.744861  0.227263
2    0.179324  0.419793  0.618058  0.959727  0.667112
3    0.898675  0.160934  0.245006  0.538150  0.240019
4    0.769776  0.194763  0.779606  0.300935  0.284339
..        ...       ...       ...       ...       ...
330  0.417969  0.557649  0.651348  0.749245  0.677820
331  0.029971  0.659181  0.707935  0.523440  0.486447
332  0.405907  0.973064  0.912357  0.027224  0.767961
333  0.285228  0.715706  0.667353  0.810588  0.326163
334  0.487511  0.413026  0.327319  0.082499  0.525288

[335 rows x 5 columns]

In [12]:
df.head(10)

          0         1         2         3         4
0  0.470772  0.249239  0.210232  0.705268  0.585135
1  0.533156  0.933199  0.552222  0.744861  0.227263
2  0.179324  0.419793  0.618058  0.959727  0.667112
3  0.898675  0.160934  0.245006  0.538150  0.240019
4  0.769776  0.194763  0.779606  0.300935  0.284339
5  0.502597  0.375512  0.251439  0.864990  0.916767
6  0.810259  0.412173  0.578443  0.061936  0.838435
7  0.724307  0.806065  0.076488  0.339647  0.030609
8  0.227709  0.567885  0.384204  0.510095  0.456513
9  0.595865  0.588487  0.346390  0.469092  0.523229

In [13]:
df.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [16]:
df[0][0] = 'Uzair'

C:\Users\Uzer\AppData\Local\Temp\ipykernel_10600\3349648398.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df[0][0] = 'Uzair'
C:\Users\Uzer\AppData\Local\Temp\ipykernel_10600\3349648398.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Uzair' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df[0][0] = 'Uzair'

In [17]:
df.head()

          0         1         2         3         4
0     Uzair  0.249239  0.210232  0.705268  0.585135
1  0.533156  0.933199  0.552222  0.744861  0.227263
2  0.179324  0.419793  0.618058  0.959727  0.667112
3  0.898675  0.160934  0.245006  0.538150  0.240019
4  0.769776  0.194763  0.779606  0.300935  0.284339

In [18]:
df.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [20]:
type(df[1][1])

numpy.float64

In [27]:
np.dtype(df[1])

dtype('float64')

In [30]:
npy = df.to_numpy()

In [31]:
npy

array([['Uzair', 0.24923916690144443, 0.21023239903327495,
        0.7052675907088347, 0.5851354012548551],
       [0.533156338055643, 0.9331991188046839, 0.5522221960535585,
        0.7448609206014852, 0.2272625426669006],
       [0.17932369078949317, 0.4197927494038559, 0.6180579294926498,
        0.9597266207314845, 0.6671123688722985],
       ...,
       [0.40590682520559784, 0.9730635049699348, 0.9123569585600079,
        0.0272242266271695, 0.7679605264437263],
       [0.2852277429039005, 0.7157057927072795, 0.6673527811473527,
        0.8105882552194231, 0.32616256014255485],
       [0.4875110019688219, 0.41302567565008874, 0.3273186087255736,
        0.08249852531763169, 0.5252882671794804]],
      shape=(335, 5), dtype=object)

In [32]:
npy.shape

(335, 5)

In [36]:
npy.ravel()[123]

0.6954569203044028

In [38]:
df.columns = list('ABCDE')

In [40]:
df.head()

          A         B         C         D         E
0     Uzair  0.249239  0.210232  0.705268  0.585135
1  0.533156  0.933199  0.552222  0.744861  0.227263
2  0.179324  0.419793  0.618058  0.959727  0.667112
3  0.898675  0.160934  0.245006  0.538150  0.240019
4  0.769776  0.194763  0.779606  0.300935  0.284339

In [41]:
df.loc[0,0] = 123

In [46]:
df.head()

          A         B         C         D         E      0
0      2563  0.249239  0.210232  0.705268  0.585135  123.0
1  0.533156  0.933199  0.552222  0.744861  0.227263    NaN
2  0.179324  0.419793  0.618058  0.959727  0.667112    NaN
3  0.898675  0.160934  0.245006  0.538150  0.240019    NaN
4  0.769776  0.194763  0.779606  0.300935  0.284339    NaN

In [47]:
df.loc[0,'A'] = 2563

In [48]:
df.head()

          A         B         C         D         E      0
0      2563  0.249239  0.210232  0.705268  0.585135  123.0
1  0.533156  0.933199  0.552222  0.744861  0.227263    NaN
2  0.179324  0.419793  0.618058  0.959727  0.667112    NaN
3  0.898675  0.160934  0.245006  0.538150  0.240019    NaN
4  0.769776  0.194763  0.779606  0.300935  0.284339    NaN

In [51]:
df = df.drop(0, axis=1)

In [53]:
df.head()

          A         B         C         D         E
0      2563  0.249239  0.210232  0.705268  0.585135
1  0.533156  0.933199  0.552222  0.744861  0.227263
2  0.179324  0.419793  0.618058  0.959727  0.667112
3  0.898675  0.160934  0.245006  0.538150  0.240019
4  0.769776  0.194763  0.779606  0.300935  0.284339

In [54]:
df.loc[1,1] = 'uzair'

In [55]:
df.head()

          A         B         C         D         E      1
0      2563  0.249239  0.210232  0.705268  0.585135    NaN
1  0.533156  0.933199  0.552222  0.744861  0.227263  uzair
2  0.179324  0.419793  0.618058  0.959727  0.667112    NaN
3  0.898675  0.160934  0.245006  0.538150  0.240019    NaN
4  0.769776  0.194763  0.779606  0.300935  0.284339    NaN

In [56]:
df.loc[2,3] = 0123.23

In [57]:
df.loc[3,"m"] = 58

In [58]:
df.loc[0,2] = 1345

In [69]:
df.head()

,A,B,C,D,E,1,3,m,2
0,2563,0.249239,0.210232,0.705268,0.585135,NaN,NaN,NaN,1345.0
1,0.533156,0.933199,0.552222,0.744861,0.227263,uzair,NaN,NaN,NaN
2,0.179324,0.419793,0.618058,0.959727,0.667112,NaN,123.23,NaN,NaN
3,0.898675,0.160934,0.245006,0.538150,0.240019,NaN,NaN,58.0,NaN
4,0.769776,0.194763,0.779606,0.300935,0.284339,NaN,NaN,NaN,NaN

In [71]:
df = df.drop(1, axis=1)

In [72]:
df = df.drop(3, axis=1)

In [73]:
df = df.drop('m', axis=1)

In [74]:
df = df.drop(2, axis=1)

In [77]:
df.loc['A', 'A'] = 10101

In [79]:
df.tail()

            A         B         C         D         E
331  0.029971  0.659181  0.707935  0.523440  0.486447
332  0.405907  0.973064  0.912357  0.027224  0.767961
333  0.285228  0.715706  0.667353  0.810588  0.326163
334  0.487511  0.413026  0.327319  0.082499  0.525288
A       10101       NaN       NaN       NaN       NaN

In [81]:
df = df.drop('A')

In [83]:
df.tail()

            A         B         C         D         E
330  0.417969  0.557649  0.651348  0.749245  0.677820
331  0.029971  0.659181  0.707935  0.523440  0.486447
332  0.405907  0.973064  0.912357  0.027224  0.767961
333  0.285228  0.715706  0.667353  0.810588  0.326163
334  0.487511  0.413026  0.327319  0.082499  0.525288

In [92]:
df.loc[[3,4],['C','D']]

          C         D
3  0.245006  0.538150
4  0.779606  0.300935

In [95]:
df.loc[(df.A > 0.5)]

            A         B         C         D         E
0        2563  0.249239  0.210232  0.705268  0.585135
3    0.898675  0.160934  0.245006  0.538150  0.240019
4    0.769776  0.194763  0.779606  0.300935  0.284339
5    0.502597  0.375512  0.251439  0.864990  0.916767
6    0.810259  0.412173  0.578443  0.061936  0.838435
..        ...       ...       ...       ...       ...
316   0.60314  0.805752  0.321692  0.719849  0.924356
322   0.52332  0.270212  0.012748  0.455039  0.906650
325  0.950831  0.610447  0.489111  0.427088  0.905006
327  0.813337  0.061982  0.942879  0.221491  0.665808
329  0.541206  0.882159  0.692241  0.311745  0.620318

[169 rows x 5 columns]

In [99]:
df.loc[(df.A > 0.85) & (df.D < 0.1)]

            A         B         C         D         E
150  0.903545  0.819173  0.636309  0.041162  0.105192
186  0.888156  0.605784  0.050661  0.045044  0.549334
242  0.905927  0.171317  0.706982  0.027114  0.871246
247  0.929829  0.961607  0.304710  0.045363  0.455174
275  0.879211  0.401661  0.544896  0.031324  0.135358
287  0.888833  0.905424  0.079625  0.046306  0.476857
304  0.885369  0.190821  0.591767  0.001207  0.712985

In [101]:
df.loc[(df.C < 0.09) & (df.E > 0.7)]

            A         B         C         D         E
18   0.388835  0.985244  0.025021  0.285334  0.809142
36   0.610466  0.475509  0.084747  0.527842  0.845963
45   0.410497  0.786096  0.056081  0.573251  0.766850
84    0.76507  0.570356  0.075613  0.549800  0.823340
85   0.165618  0.287486  0.021115  0.082774  0.768572
97    0.06567  0.853804  0.056591  0.407027  0.843147
100  0.558434  0.741512  0.059493  0.757518  0.819378
141  0.432118  0.646832  0.086551  0.053114  0.880324
244  0.092445  0.350991  0.005847  0.541086  0.759112
291  0.870782  0.761332  0.025053  0.690457  0.723217
322   0.52332  0.270212  0.012748  0.455039  0.906650

In [104]:
df.loc[(df.A <0.04)]

            A         B         C         D         E
11   0.010744  0.706522  0.841843  0.121772  0.637847
24   0.019956  0.949061  0.495886  0.695457  0.916847
32   0.010259  0.699766  0.516772  0.479407  0.029211
38   0.019376  0.522708  0.077396  0.657900  0.437514
109  0.025244  0.523491  0.416964  0.701658  0.326321
111  0.031763  0.291352  0.446829  0.031722  0.445128
112  0.024921  0.589110  0.989068  0.509522  0.642660
113  0.018431  0.999080  0.330882  0.976676  0.703821
119   0.00836  0.211534  0.812204  0.444406  0.252021
138  0.020853  0.050190  0.406139  0.789916  0.837886
148  0.021613  0.393297  0.743828  0.413821  0.695567
238  0.009738  0.725224  0.413725  0.083420  0.554258
331  0.029971  0.659181  0.707935  0.523440  0.486447

In [105]:
df.loc[(df.B < 0.01)]

            A         B         C         D         E
26   0.878243  0.009841  0.715577  0.700617  0.272922
203  0.270779  0.007426  0.721745  0.599056  0.732872
286  0.369833  0.008150  0.281454  0.411931  0.979922

In [107]:
df.B.min()

np.float64(0.007425688901325445)

In [108]:
df.D.max()

np.float64(0.9963798311901542)

In [109]:
df.A.std()

np.float64(140.21420373452327)

In [111]:
df.describe()

                B           C           D           E
count  334.000000  334.000000  334.000000  334.000000
mean     0.511378    0.520567    0.503958    0.500234
std      0.277744    0.293164    0.286725    0.283905
min      0.007426    0.000808    0.001207    0.007831
25%      0.269603    0.269656    0.276532    0.236955
50%      0.508731    0.542089    0.483032    0.514475
75%      0.741313    0.778400    0.747343    0.739422
max      0.999080    0.996343    0.996380    0.994450

In [113]:
df.A.describe()

count     334.000000
unique    334.000000
top         0.487511
freq        1.000000
Name: A, dtype: float64

In [114]:
df.B.describe()

count    334.000000
mean       0.511378
std        0.277744
min        0.007426
25%        0.269603
50%        0.508731
75%        0.741313
max        0.999080
Name: B, dtype: float64

In [115]:
df.D.describe()

count    334.000000
mean       0.503958
std        0.286725
min        0.001207
25%        0.276532
50%        0.483032
75%        0.747343
max        0.996380
Name: D, dtype: float64

In [116]:
df.D.std()

np.float64(0.2867245853866536)

In [117]:
df.A[0] = 0.125

C:\Users\Uzer\AppData\Local\Temp\ipykernel_10600\1644215508.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.A[0] = 0.125

In [120]:
df.A.describe()

count     334.000000
unique    334.000000
top         0.487511
freq        1.000000
Name: A, dtype: float64

In [122]:
df1 = df.loc[(df.A > 0.5)]

In [135]:
df.loc[3, 'D']

np.float64(0.5381501947262411)

In [128]:
df.iloc[1,3]

np.float64(0.9597266207314845)

In [130]:
df.head()

          A         B         C         D         E
0     0.125  0.249239  0.210232  0.705268  0.585135
2  0.179324  0.419793  0.618058  0.959727  0.667112
3  0.898675  0.160934  0.245006  0.538150  0.240019
4  0.769776  0.194763  0.779606  0.300935  0.284339
5  0.502597  0.375512  0.251439  0.864990  0.916767

In [131]:
df.iloc[2,4]

np.float64(0.24001893799107266)

In [134]:
df.loc[0,'A']

0.125

In [136]:
df.drop(['A','C'], axis=1)

            B         D         E
0    0.249239  0.705268  0.585135
2    0.419793  0.959727  0.667112
3    0.160934  0.538150  0.240019
4    0.194763  0.300935  0.284339
5    0.375512  0.864990  0.916767
..        ...       ...       ...
330  0.557649  0.749245  0.677820
331  0.659181  0.523440  0.486447
332  0.973064  0.027224  0.767961
333  0.715706  0.810588  0.326163
334  0.413026  0.082499  0.525288

[334 rows x 3 columns]

In [137]:
df.head(3)

          A         B         C         D         E
0     0.125  0.249239  0.210232  0.705268  0.585135
2  0.179324  0.419793  0.618058  0.959727  0.667112
3  0.898675  0.160934  0.245006  0.538150  0.240019

In [140]:
df.reset_index(drop=True, inplace=True)

In [142]:
df.head(3)

          A         B         C         D         E
0     0.125  0.249239  0.210232  0.705268  0.585135
1  0.179324  0.419793  0.618058  0.959727  0.667112
2  0.898675  0.160934  0.245006  0.538150  0.240019

In [146]:
df1.reset_index().head(5)

   index         A         B         C         D         E
0      3  0.898675  0.160934  0.245006  0.538150  0.240019
1      4  0.769776  0.194763  0.779606  0.300935  0.284339
2      5  0.502597  0.375512  0.251439  0.864990  0.916767
3      6  0.810259  0.412173  0.578443  0.061936  0.838435
4      7  0.724307  0.806065  0.076488  0.339647  0.030609

In [149]:
df1.reset_index(drop=True, inplace=True)

In [150]:
df1.head(5)

          A         B         C         D         E
0  0.898675  0.160934  0.245006  0.538150  0.240019
1  0.769776  0.194763  0.779606  0.300935  0.284339
2  0.502597  0.375512  0.251439  0.864990  0.916767
3  0.810259  0.412173  0.578443  0.061936  0.838435
4  0.724307  0.806065  0.076488  0.339647  0.030609

In [159]:
df.loc[ 5:, ['B']] = None

In [160]:
df.head(2)

          A   B         C         D         E
0     0.125  56  0.210232  0.705268  0.585135
1  0.179324  56  0.618058  0.959727  0.667112

In [161]:
df.B.isnull()

0      False
1      False
2      False
3      False
4      False
       ...
329     True
330     True
331     True
332     True
333     True
Name: B, Length: 334, dtype: bool

In [187]:
d1 = {
      'Name':['Uzer','Bilal','Nahyan','Arfat','Shadab','Farhan','Anas','Uzer'],
      'A': [1, 2, 3, 2, 4, 5, 3, 8], 
      'B': [5, 6, 9, 2, 8, 7, 6, 8,]
     }

In [188]:
num = pd.DataFrame(d1)

In [189]:
num.drop_duplicates(subset=['A'], keep="last")

     Name  A  B
0    Uzer  1  5
3   Arfat  2  2
4  Shadab  4  8
5  Farhan  5  7
6    Anas  3  6
7    Uzer  8  8

In [190]:
num

     Name  A  B
0    Uzer  1  5
1   Bilal  2  6
2  Nahyan  3  9
3   Arfat  2  2
4  Shadab  4  8
5  Farhan  5  7
6    Anas  3  6
7    Uzer  8  8

In [191]:
num.drop_duplicates(subset=['B'])

     Name  A  B
0    Uzer  1  5
1   Bilal  2  6
2  Nahyan  3  9
3   Arfat  2  2
4  Shadab  4  8
5  Farhan  5  7

In [192]:
num.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    8 non-null      object
 1   A       8 non-null      int64
 2   B       8 non-null      int64
dtypes: int64(2), object(1)
memory usage: 324.0+ bytes

In [193]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 334 entries, 0 to 333
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       334 non-null    object
 1   B       5 non-null      object
 2   C       334 non-null    float64
 3   D       334 non-null    float64
 4   E       334 non-null    float64
dtypes: float64(3), object(2)
memory usage: 13.2+ KB

In [195]:
num.B.value_counts()

B
6    2
8    2
5    1
9    1
2    1
7    1
Name: count, dtype: int64

In [196]:
num.A.value_counts()

A
2    2
3    2
1    1
4    1
5    1
8    1
Name: count, dtype: int64

In [197]:
num.Name.value_counts()

Name
Uzer      2
Bilal     1
Nahyan    1
Arfat     1
Shadab    1
Farhan    1
Anas      1
Name: count, dtype: int64

In [202]:
arr = num.Name.unique()

In [207]:
arr

array(['Uzer', 'Bilal', 'Nahyan', 'Arfat', 'Shadab', 'Farhan', 'Anas'],
      dtype=object)